---
kind: property
id: P:Autodesk.Revit.DB.SweptBlend.SelectedPath
source: html/c2b81203-1f5c-fd0d-1d4e-8dac7b4659f1.htm
---
# Autodesk.Revit.DB.SweptBlend.SelectedPath Property

The selected curve used for the swept blend path.

## Syntax (C#)
```csharp
public Curve SelectedPath { get; }
```

## Remarks
If the swept blend is based on a sketched path, this property is Nothing nullptr a null reference ( Nothing in Visual Basic) .